Dlubal.RFEM5.MemberElasticFoundation
Member elastic foundation parameters

Dlubal.RFEM5.MemberElasticFoundation.No
Number

Dlubal.RFEM5.MemberElasticFoundation.ID
Identifier

Dlubal.RFEM5.MemberElasticFoundation.Comment
Comment

Dlubal.RFEM5.MemberElasticFoundation.Tag
Tag

Dlubal.RFEM5.MemberElasticFoundation.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.MemberElasticFoundation.MemberList
List of members with this elastic foundation

Dlubal.RFEM5.MemberElasticFoundation.TranslationX
Translational spring constant C1,x

Dlubal.RFEM5.MemberElasticFoundation.TranslationY
Translational spring constant C1,y

Dlubal.RFEM5.MemberElasticFoundation.TranslationZ
Translational spring constant C1,z

Dlubal.RFEM5.MemberElasticFoundation.ShearX
Shear spring constant C2,x

Dlubal.RFEM5.MemberElasticFoundation.ShearY
Shear spring constant C2,y

Dlubal.RFEM5.MemberElasticFoundation.ShearZ
Shear spring constant C3,z

Dlubal.RFEM5.MemberElasticFoundation.Rotation
Rotational spring constant CPhi

Dlubal.RFEM5.MemberElasticFoundation.Ineffective
Ineffective foundation